# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent bash
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'
brew 'vim'

# Install Binaries
brew 'certbot'
brew 'ffmpeg'
brew 'ghostscript'
brew 'git'
brew 'gnu-typist'
brew 'helm'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'hugo'
brew 'imagemagick'
brew 'mas'
brew 'nmap'
brew 'nnn'
brew 'pandoc'
brew 'pandoc-crossref'
brew 'pyenv'
brew 'python'
brew 'ranger'
brew 'rbenv'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'w3m'
brew 'wget'

# Apps via casks
#cask '1password'
#cask 'alfred'
#cask 'backblaze'
#cask 'bartender'
#cask 'brave-browser'
#cask 'calibre'
#cask 'cleanmymac'
#cask 'dash'
#cask 'deepl'
#cask 'devonagent'
#cask 'devonthink'
cask 'docker'
#cask 'dropbox'
#cask 'expressvpn'
cask 'firefox'
#cask 'forklift'
#cask 'iterm2'
cask 'skype'
cask 'slack'
cask 'transmission'
#cask 'vagrant'
#cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Mac App Store
mas '1Blocker', id:1107421413
mas 'FruitJuice', id:671736912
mas 'Keynote', id: 409183694
