# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent bash
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'
brew 'vim'

# Install Binaries
brew 'bash'
brew 'certbot'
brew 'ffmpeg'
brew 'ghostscript'
brew 'git'
brew 'gnu-typist'
brew 'helm'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'mackup' 
brew 'nmap'
brew 'nnn'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'pandoc-crossref'
brew 'pyenv'
brew 'python'
brew 'ranger'
brew 'rbenv'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'w3m'
brew 'wget'

#Install Filebeat
#brew 'elastic/tap/filebeat-oss'

# Quicklook
cask 'qlcolorcode'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-meslo-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
